# 데이터 프레임의 세계로!
## 데이터 프레임 만들기 - 시험 성적 데이터를 만들어보자!
### 데이터를 입력해 데이터 프레임 만들기

In [5]:
#pandas 패키지를 로드
import pandas as pd

In [38]:
# data frame만들기
# data frame 변수 = df

d = pd.DataFrame({'name':['김지훈','이유진','박동현','김민지'],
                  'english':[90,80,60,70],
                  'math':[50,60,100,20]})
d

  name  english  math
0  김지훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [39]:
#특정 변수의 값을 추출하기
#영어 점수만 출력

d['english']

0    90
1    80
2    60
3    70
Name: english, dtype: int64

In [40]:
d['math']

0     50
1     60
2    100
3     20
Name: math, dtype: int64

In [41]:
#변수의 값으로 합계구하기
#sum

sum(d['english'])

300

In [43]:
#수학평균
sum(d['math'])

#과목별 평균
print(sum(d['english']) / len(d))
print(sum(d['math']) / len(d))

75.0
57.5

# 외부 데이터 이용하기 - 축적된 시험 성적 데이터를 불러오자!
### 엑셀 파일 불러오기
#### 1. 엑셀 파일 살펴보기
#### 2. 워킹 디렉터리에 엑셀 파일 삽입하기
#### 3. 엑셀 파일 불러오기

In [18]:
#외부파일 불러오는 매소드 read_excel("디랙토리/파일명)
# 변수에 할당
df_exam = pd.read_excel("excel_exam.xlsx")

In [19]:
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [36]:
#영어 점수 합계 구하기

print(sum(df_exam['english']))
print(sum(df_exam['english']) / len(df_exam))

1698
84.9

In [37]:
# 수학

print(sum(df_exam['math']))
print(sum(df_exam['math'])/len(df_exam))

1149
57.45

In [35]:
#과학

print(sum(df_exam['science']))
print(sum(df_exam['science'])/len(df_exam))

1189
59.45

In [27]:
df = pd.DataFrame({'제품':['사과','딸기','수박'],
                  '가격':[1800,1500,3000],
                  '판매량':[24,38,13]})
df

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [34]:
#가격의 평균
print(sum(df['가격'])/len(df))

#판매량 평균
print(sum(df['판매량'])/len(df))

2100.0
25.0

In [30]:
x = [1,2,3,4,5]
x

[1, 2, 3, 4, 5]

In [31]:
len(x)

5

In [32]:
len(df)

3

In [48]:
df_exam_novar=pd.read_excel('excel_exam_novar.xlsx', header=None) #머릿글이 없을때 옵션 header = none
df_exam_novar

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15
5  6  3  50  98  45
6  7  4  46  98  65
7  8  4  48  87  12